{
  "1": [
    {
      "topic": "Lesson Format",
      "q": "What format are lessons written in?",
      "a": "Markdown. The build script converts `.md` files to HTML and injects them into page templates. You can use all standard markdown plus HTML when needed."
    },
    {
      "topic": "Code Highlighting",
      "q": "How do you get syntax highlighting in code blocks?",
      "a": "Use fenced code blocks with a language tag: ` ```python `. The engine uses highlight.js which supports 190+ languages."
    },
    {
      "topic": "Side-by-Side",
      "q": "How do you create side-by-side code comparisons?",
      "a": "Put an italic label (`*Label*`) on its own line before a fenced code block. Two consecutive labeled blocks are automatically displayed side-by-side in a `.code-compare` div."
    },
    {
      "topic": "Callouts",
      "q": "How do you create a callout/tip box in a lesson?",
      "a": "Use a blockquote with a bold label: `> **Tip:** Your message here.` Common labels: Tip, Warning, Note, Important."
    }
  ],
  "2": [
    {
      "topic": "Exercise Files",
      "q": "Where do exercise files go and what are they named?",
      "a": "`courses/<slug>/content/exercises/moduleN-variants.json`. The N matches the module ID from course.json. Set `hasExercises: true` in the module definition."
    },
    {
      "topic": "Variants",
      "q": "What is the variant system?",
      "a": "Each exercise has multiple variants — different problems testing the same concept. The engine picks one at random each time, so repeated practice stays fresh. Users can shuffle to get a different variant."
    },
    {
      "topic": "Self-Rating",
      "q": "What are the three self-rating options after an exercise?",
      "a": "**Got it** (interval increases), **Struggled** (interval stays short), **Had to peek** (interval resets to 1 day). These feed the SRS algorithm."
    },
    {
      "topic": "SRS Key",
      "q": "What format does the SRS system use to track individual exercises?",
      "a": "`m{moduleNum}_{exerciseId}_{variantId}` — for example, `m3_warmup_2_v1`. Each variant is tracked independently with its own ease factor and interval."
    }
  ],
  "3": [
    {
      "topic": "Flashcard File",
      "q": "Where are flashcards defined?",
      "a": "`courses/<slug>/content/flashcards/flashcards.json`. It's a JSON object where keys are module IDs (as strings) and values are arrays of card objects with `topic`, `q`, and `a` fields."
    },
    {
      "topic": "SRS Algorithm",
      "q": "What algorithm does the SRS system use?",
      "a": "SM-2 (the algorithm behind Anki). Each item has an ease factor that adjusts based on ratings. The minimum ease factor is 1.3 to prevent impossibly short intervals."
    },
    {
      "topic": "Data Storage",
      "q": "Where is all user progress stored?",
      "a": "localStorage in the browser. Each course uses a `storagePrefix` to namespace its keys. There is no backend — everything is client-side. Users can export/import data as JSON."
    },
    {
      "topic": "Offline Support",
      "q": "How does offline support work?",
      "a": "A service worker (generated at build time) caches all assets. After the first visit, the entire site works offline. The SW uses a network-first strategy with cache fallback."
    }
  ]
}
